<template>
  <div class="detailContainer">
    <div class="noticeWrap"> 
      <div class="noticeMessage">
        <div class="icon"></div>
        <div class="date">
          <p>叶光恒</p>
          <p>2020-10-28</p>
        </div>
      </div> 
      <p class="title">关于期末考试的通知</p>
      <div class="article">
        期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。
        期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。
        期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。
        期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。期末考试定于2020年9月20日进行，请各位同学好好努力。
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: 'noticeDetail'
}
</script>

<style scoped lang="less">
  .detailContainer {
    width: 1000px;
    padding: 50px 20px 30px 20px;
    margin: 0 auto;
    position: relative;
    .noticeWrap {
      height: auto;
      padding: 30px 30px;
      border-radius: 10px;
      box-shadow: 0 2px 8px rgba(0, 0, 0, 0.2);
      .noticeMessage {
        position: absolute;
        top: 70px;
        .icon {
          width: 50px;
          height: 50px;
          display: inline-block;
          vertical-align: bottom;
          border-radius: 50%;
          background: url('../../../../assets/teacher.png');
          background-size: cover;
          background-repeat: no-repeat;
        }
        .date {
          display: inline-block;
          p {
            font-size: 14px;
            font-weight: 500;
            margin-bottom: 0;
          }
        }
      }
      .title {
        font-size: 20px;
        font-weight: 500;
        text-align: center;
      }
      .article {
        margin-top: 30px;
      }   
    }
  }
</style>
